Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/19/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-MBeEucvqQ71W4nyz

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_3: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.local-storage-class: Refreshing state...
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespaceOverride: grafana
                grafana.ini:
                  server:
                    domain: "gently-concise-dogfish.ngrok-free.app"
                    root_url: "%(protocol)s://%(domain)s/grafana"
                    serve_from_sub_path: true
                ingress:
                  enabled: true
                  hosts:
                    - "gently-concise-dogfish.ngrok-free.app"
                  path: "/grafana"
            EOT,
        ]
      + verify                     = false
      + version                    = "6.61.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                write:
                  persistence:
                    size: 3Gi
                read:
                  persistence:
                    size: 3Gi
                backend:
                  persistence:
                    size: 3Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "5.35.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                initContainer:
                  # -- Specifies whether the init container for setting inotify max user instances is to be enabled
                  - name: init
                    # -- Docker registry, image and tag for the init container image
                    image: docker.io/busybox:1.33
                    # -- Docker image pull policy for the init container image
                    imagePullPolicy: IfNotPresent
                    # -- The inotify max user instances to configure
                    command:
                      - sh
                      - -c
                      - sysctl -w fs.inotify.max_user_instances=512
                    securityContext:
                      privileged: true
            EOT,
        ]
      + verify                     = false
      + version                    = "6.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>